//===================================================================================================================================
//【3DSound.h】
// [作成者]HAL東京GP12A332 16 蔡 友剛
// [作成日]2019/10/29
// [更新日]2019/10/29
//===================================================================================================================================
#pragma once
//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "Base.h"
#include "GameMaster.h"
#include "LinkedList.h"
#include "SoundBase.h"

//===================================================================================================================================
//【マクロ定義】
//===================================================================================================================================
#define S3D_PATH_LIST_TAIL(num)			S3DPathList##[num]

//===================================================================================================================================
//【列挙型定数】
//===================================================================================================================================
enum S3D_LIST
{
	S3D_FOOTSTEP_01,
	S3D_FOOTSTEP_02,
	S3D_FOOTSTEP_03,
	S3D_PLAYER_WALK,
	S3D_MAX
};

//===================================================================================================================================
//【定数定義】
//===================================================================================================================================
static const char *S3DPathList[] = { "3D_ADD_TREE01.wav","3D_Enemy_Walk00.wav","3D_Enemy_Walk01.wav","3D_PLAYER_WALK.wav" };

//===================================================================================================================================
//【サウンド(XAudio2)】
//サウンドの3DSoundクラス
//===================================================================================================================================
class S3DManager:public SoundBase
{
public:
	S3DManager();
	~S3DManager();

	//基本機能
	void SetVolume(const PLAY_PARAMETERS playParameters, float volume);	//ボリューム

	//debug用
#if _DEBUG
	void	 outputGUI(void)override;				//ImGUIへの出力
#endif

private:
#if(XADUIO2_STATE)
	//ミッドポイントボイス
	IXAudio2SubmixVoice		*MidpointVoice[gameMasterNS::PLAYER_NUM];	//XAudio2 Midpoint Voice[2 player]
	XAUDIO2_VOICE_SENDS		MidSendList[gameMasterNS::PLAYER_NUM];		//XAudio2 Send List(P1/P2 Midpoint Voice)
	XAUDIO2_SEND_DESCRIPTOR	SendDescriptor[gameMasterNS::PLAYER_NUM];	//XAudio2 Send Descriptor(BGM/SE Endpoint Voice)

	//ソースボイスの作成
	void MakeSourceVoice(PLAY_PARAMETERS *playParameters, LIST_BUFFER *listBuffer)override;

	void loadBuffer(void)override;
#endif
};