//-----------------------------------------------------------------------------
// バッテリークラス [Battery.cpp]
// Author : 
// 作成開始日 : 2019/  /  
//-----------------------------------------------------------------------------
#include "Battery.h"
#include "ImguiManager.h"
using namespace itemNS;



//=============================================================================
// コンストラクタ
//=============================================================================
Battery::Battery(StaticMesh* _staticMesh, ItemData _itemData): Item(_staticMesh, _itemData)
{

}

//
////=============================================================================
//// 初期化　※インスタンスごとではなくマネージャで一回のみ
////=============================================================================
//void Battery::initialize(StaticMesh* _staticMesh)
//{
//	sphereCollider.initialize(NULL, _staticMesh->mesh);
//}


//=============================================================================
// 更新処理
//=============================================================================
void Battery::update(float frameTime)
{
	Item::update(frameTime);
}


//=============================================================================
// 描画処理
//=============================================================================
void Battery::render(D3DXMATRIX view, D3DXMATRIX projection, D3DXVECTOR3 cameraPosition)
{
	//Item::render(view, projection, cameraPosition);
}


////=============================================================================
//// 衝突判定
////=============================================================================
//bool Battery::sphereCollide(D3DXVECTOR3 targetCenter, float targetRadius, D3DXMATRIX targetMatrix)
//{
//	return sphereCollider.collide(targetCenter, targetRadius, matrixWorld, targetMatrix);
//}


//=============================================================================
// Getter
//=============================================================================


//=============================================================================
// Setter
//=============================================================================
