//===================================================================================================================================
//【Bullet.h】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/11/05
// [更新日]2019/11/05
//===================================================================================================================================
#pragma once

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "Object.h"
#include "LinkedList.h"
#include "Ray.h"

namespace bulletNS{
	const float BULLET_SPEED = 1.0f;
}

//===================================================================================================================================
//【バレットクラス】
//===================================================================================================================================
class Bullet :	public Object
{
private:
	D3DXVECTOR3		launchPosition;			//発射位置
	Ray				ballisticRay;			//弾道レイ
	D3DXVECTOR3		collisionPosition;		//衝突位置
	D3DXVECTOR3		speed;					//速度
	D3DXVECTOR3		before;					//1フレーム前位置
	D3DXVECTOR3		after;					//1フレーム後位置
	float			existenceTime;			//生存時間

public:
	Bullet(D3DXVECTOR3 start,D3DXVECTOR3 speed);
	~Bullet();
	void update(float frameTime);
	void collide();
};

//===================================================================================================================================
//【バレットマネージャクラス】
//===================================================================================================================================
class BulletManager :public Base
{
private:
	LinkedList<Bullet*>*	bulletList;
	float					intervalTime;

public:
	BulletManager();
	~BulletManager();
	void launch(Ray shootingRay);
	void update(float frameTime);
};
