//===================================================================================================================================
//【DamageUI.h】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/12/22
// [更新日]2019/12/22
//===================================================================================================================================
#pragma once

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "Base.h"
#include "Sprite.h"
#include "GameMaster.h"

//===================================================================================================================================
//【名前空間】
//===================================================================================================================================
namespace DamageUINS
{
	const int WIDTH		= WINDOW_WIDTH / 2;			//テクスチャ全体の幅
	const int HEIGHT	= WINDOW_HEIGHT;			//テクスチャ全体の高さ	
	const D3DXVECTOR3 POSITION1 = D3DXVECTOR3((float)WINDOW_WIDTH / 4, (float)WINDOW_HEIGHT / 2, 0.0f);
	const D3DXVECTOR3 POSITION2 = D3DXVECTOR3((float)WINDOW_WIDTH / 4 * 3, (float)WINDOW_HEIGHT / 2, 0.0f);
	const D3DXVECTOR3 ROTATION = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	const D3DCOLOR COLOR = D3DCOLOR_RGBA(255, 255, 255, 0);

	const float DISPLAY_TIME = 0.8f;
}
//===================================================================================================================================
//【ダメージUI】
//===================================================================================================================================
class DamageUI :public Base
{
private:
	Sprite* sprite;
	float displayTime[gameMasterNS::PLAYER_NUM];
public:
	DamageUI();
	~DamageUI();

	void damaged(int playerNo);
	void update(float frameTime);
	void render(int playerNo);

};

