//===================================================================================================================================
//【DirectInputController.h】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/09/19
// [更新日]2019/09/19
//===================================================================================================================================
#pragma once

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "Base.h"
#define DIRECTINPUT_VERSION 0x800
#include <dinput.h>
#include <dxerr.h>

//===================================================================================================================================
//【ライブラリのロード】
//===================================================================================================================================
#pragma comment( lib, "dxerr.lib" )
#pragma comment(lib,"dinput8.lib")
#pragma comment( lib, "dxguid.lib" )

//===================================================================================================================================
//【マクロ定義】
//===================================================================================================================================
#define DIDEVICE_BUFFERSIZE 100;		// デバイスに設定するバッファ・サイズ

//===================================================================================================================================
//【DInputコントローラクラス】
//===================================================================================================================================
class DirectInputController:public Base
{
public:
	//Data
	LPDIRECTINPUTDEVICE8 device;	// DirectInputデバイス
	DIDEVCAPS deviceCaps;			// ジョイスティックの能力
	DIJOYSTATE2 joyState;			// 状態保存変数
	DIDEVICEOBJECTDATA objectData;	// POV保存変数(十字キー)
	TCHAR name[MAX_PATH + 1];		// コントローラの名前
	bool connected;					// 接続状態

	//Method
	HRESULT initialize(HWND wnd);
	void update(bool windowActivate);
	DirectInputController() {device = NULL;}

	static BOOL CALLBACK EnumObjectsCallback(LPCDIDEVICEOBJECTINSTANCE, VOID* pContext);
};