//===================================================================================================================================
//【EffekseerManager.cpp】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/10/18
// [更新日]2019/10/21
//===================================================================================================================================

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "EffekseerManager.h"
#include "Direct3D9.h"

//===================================================================================================================================
//【using宣言】
//===================================================================================================================================
using namespace effekseerNS;

//===================================================================================================================================
//【グローバル変数】
//===================================================================================================================================
static EffekseerManager* pointerEffekseerManager;

//===================================================================================================================================
//【コンストラクタ】
//===================================================================================================================================
EffekseerManager::EffekseerManager()
{
	pointerEffekseerManager = this;
	manager		= NULL;
	renderer	= NULL;
	sound		= NULL;	
	xa2			= NULL;
	xa2Master	= NULL;

	fileName[TEST0] = { L"test.efk" };
	fileName[TEST1] = { L"r_square.efk" };

}

//===================================================================================================================================
//【デストラクタ】
//===================================================================================================================================
EffekseerManager::~EffekseerManager()
{
	uninitialize();
}

//===================================================================================================================================
//【初期化】
//===================================================================================================================================
void EffekseerManager::initialize()
{
	// XAudio2の初期化を行う
	XAudio2Create(&xa2);
	xa2->CreateMasteringVoice(&xa2Master);

	// 描画用インスタンスの生成
	renderer = ::EffekseerRendererDX9::Renderer::Create(getDevice(), 2000);

	// エフェクト管理用インスタンスの生成
	manager = ::Effekseer::Manager::Create(2000);
	//manager = ::Effekseer::Manager::Create(2000,false);

	// 描画用インスタンスから描画機能を設定
	manager->SetSpriteRenderer(renderer->CreateSpriteRenderer());
	manager->SetRibbonRenderer(renderer->CreateRibbonRenderer());
	manager->SetRingRenderer(renderer->CreateRingRenderer());
	manager->SetTrackRenderer(renderer->CreateTrackRenderer());
	manager->SetModelRenderer(renderer->CreateModelRenderer());

	// 描画用インスタンスからテクスチャの読込機能を設定
	// 独自拡張可能、現在はファイルから読み込んでいる。
	manager->SetTextureLoader(renderer->CreateTextureLoader());
	manager->SetModelLoader(renderer->CreateModelLoader());

	// 音再生用インスタンスの生成
	sound = ::EffekseerSound::Sound::Create(xa2, 16, 16);

	// 音再生用インスタンスから再生機能を指定
	manager->SetSoundPlayer(sound->CreateSoundPlayer());

	// 音再生用インスタンスからサウンドデータの読込機能を設定
	// 独自拡張可能、現在はファイルから読み込んでいる。
	manager->SetSoundLoader(sound->CreateSoundLoader());

	//座標系の指定(LH：左手系）
	manager->SetCoordinateSystem(Effekseer::CoordinateSystem::LH);

	// 視点位置を確定
	position = ::Effekseer::Vector3D(10.0f, 5.0f, 20.0f);

	//エフェクシアーディレクトリへカレント
	setEffekseerDirectory();

	// エフェクトの読込
	for (int i = 0; i < MAX_EFFEKSEER; i++)
	{
		effect[i] = Effekseer::Effect::Create(manager, (const EFK_CHAR*)fileName[i]);
	}

}

//===================================================================================================================================
//【レンダラーの投影行列を設定】
//===================================================================================================================================
void EffekseerManager::setProjectionMatrix(float fov, float windowWidth, float windowHeight, float zn, float zf)
{
	renderer->SetProjectionMatrix(
		::Effekseer::Matrix44().PerspectiveFovLH(fov, (float)windowWidth / (float)windowHeight, zn, zf));
}

//===================================================================================================================================
//【レンダラーのカメラ行列を設定】
//===================================================================================================================================
void EffekseerManager::setCameraMatrix(D3DXVECTOR3 position,D3DXVECTOR3 eye,D3DXVECTOR3 up)
{
	this->position	= ::Effekseer::Vector3D(position.x, position.y, position.z);
	this->eye		= ::Effekseer::Vector3D(eye.x, eye.y, eye.z);
	this->up		= ::Effekseer::Vector3D(up.x, up.y, up.z);

	renderer->SetCameraMatrix(
		::Effekseer::Matrix44().LookAtLH(this->position, this->eye, this->up));
}

//===================================================================================================================================
//【再生】
//===================================================================================================================================
void EffekseerManager::play(int effekseerNo,D3DXVECTOR3 position)
{
	//instance[effekseerNo].handle = 
	manager->Play(effect[effekseerNo], position.x, position.y, position.z);
}

//===================================================================================================================================
//【一時停止/再度再生：全て】
//===================================================================================================================================
void EffekseerManager::pause(bool flag)
{
	manager->SetPausedToAllEffects(flag);
}
//===================================================================================================================================
//【一時停止/再度再生：1ハンドル】
//===================================================================================================================================
void EffekseerManager::pause(::Effekseer::Handle handle,bool flag )
{
	manager->SetPaused(handle, flag);
}

//===================================================================================================================================
//【停止】
//===================================================================================================================================
void EffekseerManager::stop(int effekseerNo)
{
	//manager->StopEffect(instance[effekseerNo].handle);
}

//===================================================================================================================================
//【終了処理】
//===================================================================================================================================
void EffekseerManager::uninitialize()
{
	manager->StopAllEffects();
	for (int i = 0; i < MAX_EFFEKSEER;i++)
	{
		// エフェクトの破棄
		ES_SAFE_RELEASE(effect[i]);
		// エフェクトの停止
	}

	// 先にエフェクト管理用インスタンスを破棄
	manager->Destroy();

	// 次に音再生用インスタンスを破棄
	sound->Destroy();

	// 次に描画用インスタンスを破棄
	renderer->Destroy();

	// XAudio2の解放
	if (xa2Master != NULL)
	{
		xa2Master->DestroyVoice();
		xa2Master = NULL;
	}
	ES_SAFE_RELEASE(xa2);

}

//===================================================================================================================================
//【更新】
//===================================================================================================================================
void EffekseerManager::update()
{
	// エフェクトの移動処理を行う
	//manager->AddLocation(handle, ::Effekseer::Vector3D(0.2f, 0.0f, 0.0f));


	//今までのPlay等の処理をUpdate実行時に適用するようにする。
	//manager->Flip();

	// エフェクトの更新処理を行う
	manager->Update();

}

//===================================================================================================================================
//【描画開始】
//===================================================================================================================================
void EffekseerManager::begin()
{
	renderer->BeginRendering();
}

//===================================================================================================================================
//【描画開始】
//===================================================================================================================================
void EffekseerManager::end()
{
	renderer->EndRendering();
}

//===================================================================================================================================
//【描画】
//===================================================================================================================================
void EffekseerManager::render()
{
	begin();
	manager->Draw();
	end();
}

//===================================================================================================================================
//【外部参照：再生】
//===================================================================================================================================
void effekseerNS::play(int effekseerNo,D3DXVECTOR3 position)
{
	pointerEffekseerManager->play(effekseerNo,position);
}

//===================================================================================================================================
//【外部参照：停止】
//===================================================================================================================================
void effekseerNS::stop(int effekseerNo)
{
	pointerEffekseerManager->stop(effekseerNo);
}

//===================================================================================================================================
//【外部参照：プロジェクション行列設定】
//===================================================================================================================================
void effekseerNS::setProjectionMatrix(float fov, float windowWidth, float windowHeight, float zn, float zf)
{
	pointerEffekseerManager->setProjectionMatrix(fov, windowWidth, windowHeight, zn, zf);
}

//===================================================================================================================================
//【外部参照：カメラ(ビュー)行列設定】
//===================================================================================================================================
void effekseerNS::setCameraMatrix(D3DXVECTOR3 position, D3DXVECTOR3 eye, D3DXVECTOR3 up)
{
	pointerEffekseerManager->setCameraMatrix(position, eye, up);
}

//===================================================================================================================================
//【外部参照：描画】
//===================================================================================================================================
void effekseerNS::render()
{
	pointerEffekseerManager->render();
}

//===================================================================================================================================
//【外部参照：一時停止】
//===================================================================================================================================
void effekseerNS::pause(bool flag)
{
	pointerEffekseerManager->pause(flag);
}

//===================================================================================================================================
//【外部参照：一時停止】
//===================================================================================================================================
void effekseerNS::pause(::Effekseer::Handle handle, bool flag)
{
	pointerEffekseerManager->pause(handle, flag);
}
