//-----------------------------------------------------------------------------
// メタAIイベント生成クラス [EventMaker.cpp]
// Author : HAL東京昼間部 2年制ゲーム学科 GP12A332 32 中込和輝
// 作成開始日 : 2019/10/12
//-----------------------------------------------------------------------------
#include "AIDirector.h"
#include "EventMaker.h"
using namespace aiNS;


//=============================================================================
// 初期化
//=============================================================================
void EventMaker::initialize(PLAYERAD* _playerAD, ENEMYAD* _enemyAD, TREEAD* _treeAD, ITEMAD* _itemAD)
{
	playerAD = _playerAD;
	enemyAD = _enemyAD;
	treeAD = _treeAD;
	itemAD = _itemAD;
}


//=============================================================================
// 終了処理
//=============================================================================
void EventMaker::uninitialize()
{
}


//=============================================================================
// 更新処理
//=============================================================================
void EventMaker::update()
{
	treeAD->numBeingAttackedTree = 5;
}
