//================================
//基本ゲージ処理[BasicGauge.cpp]
//染矢晃介
//================================

//================================
//インクルード
//================================
#include "Guage.h"

//================================
//using宣言
//================================
using namespace guageNS;

//================================
//コンストラクタ
//================================
Guage::Guage()
{
	hpGuageEmp = new HPguageEmp;
	hpGuage = new HPguage;
}

//================================
//デストラクタ
//================================
Guage::~Guage()
{
	delete hpGuageEmp;
	delete hpGuage;
}

//================================
//初期化
//================================
void Guage::initialize()
{
	hpGuageEmp->initialize();
	hpGuage->initialize();
}

//================================
//描画
//================================
void Guage::render()
{
	hpGuageEmp->render();
	hpGuage->render();
}

//================================
//更新
//================================
void Guage::update()
{
	hpGuage->update();
}