//-----------------------------------------------------------------------------
// メモリデバッグ [MemoryDebug.h]
//-----------------------------------------------------------------------------
#pragma once
#include"EnemyManager.h"
#include"TreeManager.h"
#include"ItemManager.h"


//=============================================================================
//クラス定義
//=============================================================================
class MemoryDebug
{
private:

public:
	void debugEnemyManager();
	void debugSpawnManager();
};
