//-----------------------------------------------------------------------------
// パーツアニメーション基底クラス [PartsAnimation.cpp]
// Author : HAL東京昼間部 2年制ゲーム学科 GP12A332 32 中込和輝
// 作成開始日 : 2019/12/12
//-----------------------------------------------------------------------------
#include "PartsAnimation.h"

//=============================================================================
// コンストラクタ
//=============================================================================
PartsAnimation::PartsAnimation(DWORD _flag)
{
	// フラグをセット
	flag = _flag;

	initialize();
}


//=============================================================================
// デストラクタ
//=============================================================================
PartsAnimation::~PartsAnimation()
{

}


//=============================================================================
// 初期化
//=============================================================================
void PartsAnimation::initialize()
{
	animationTime = 0.0f;
	keyFrame = 0;
	wasPlayedToEnd = true;	// 最後まで再生された状態 = 未再生状態
}


//=============================================================================
// アニメーション時間とキーフレームの更新
//=============================================================================
void PartsAnimation::updateTimeAndKeyFrame(float t)
{
	animationTime += t;
	keyFrame = (int)animationTime;	// キーフレームに変換

	if (keyFrame + 1 == numKeyFrame)
	{
		initialize();
	}
}


//=============================================================================
// 回転の更新
//=============================================================================
D3DXVECTOR3 PartsAnimation::updateRotation(const D3DXVECTOR3* rotation)
{
	return rotation[keyFrame] + (rotation[keyFrame + 1] - rotation[keyFrame]) * (animationTime - keyFrame);
}


//=============================================================================
// 現在のキーフレームを取得
//=============================================================================
int PartsAnimation::getKeyFrame()
{
	return keyFrame;
}


//=============================================================================
// キーフレームの数を取得
//=============================================================================
int PartsAnimation::getNumKeyFrame()
{
	return numKeyFrame;
}