//===================================================================================================================================
//【Splash.h】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/09/20
// [更新日]2019/09/20
//===================================================================================================================================
#pragma once

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "AbstractScene.h"
//#include "Splash2D.h"
#include "Sprite.h"
#include "SplashSprite.h"
#include "Sound.h"
#include "SoundBase.h"
#include "EnemyTools.h"

//===================================================================================================================================
//【名前空間】
//===================================================================================================================================
namespace splashNS
{
	//シーン時間
	const float SCENE_TIME = 5.0f;
}

//===================================================================================================================================
//【スプラッシュシーンクラス】
//===================================================================================================================================
class Splash :public AbstractScene
{
private:
	// スプラッシュSprite
	SplashSprite* splashSprite;

	//エネミーツール
	ENEMY_TOOLS *enemyTools;

public:
	Splash();
	~Splash();
	virtual void initialize() override;
	virtual void update(float frameTime) override;
	virtual void render() override;
	virtual void collisions() override;
	virtual void AI() override;
	virtual void uninitialize() override;
	void renderUI();

#ifdef _DEBUG
	virtual void createGUI() override;
#endif
};

