//-----------------------------------------------------------------------------
// テロップクラス [Telop.h]
// Author : HAL東京昼間部 2年制ゲーム学科 GP12A332 32 中込和輝
// 作成開始日 : 2019/10/17
//-----------------------------------------------------------------------------
#pragma once
#include "Telop.h"
#include "Sprite.h"

//=============================================================================
// 名前空間
//=============================================================================
namespace telopNS
{
	// テロップタイプ
	enum TYPE
	{
		TELOP_TYPE0,
		TELOP_TYPE1,
		TELOP_TYPE2,
		TELOP_TYPE3,
		TELOP_TYPE4,
		TELOP_TYPE5,
		TELOP_TYPE6,
		MAX_TELOP
	};
}


//=============================================================================
//クラス定義
//=============================================================================
class Telop
{
private:
	Sprite *telop = new Sprite;

public:
	void initialize();
	void uninitialize();
	void update(float frameTime);
	void render();
};
