//===================================================================================================================================
//【TestPlane.cpp】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/10/29
// [更新日]2019/10/29
//===================================================================================================================================

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "TestPlane.h"
#include "ShaderLoader.h"
#include "TextureLoader.h"

//===================================================================================================================================
//【using宣言】
//===================================================================================================================================
using namespace testPlaneNS;

//===================================================================================================================================
//【インスタンスクラス：コンストラクタ】
//===================================================================================================================================
TestPlaneInstance::TestPlaneInstance(D3DXVECTOR3 position) : InstancingBillboardNS::Instance()
{
	//初期値の設定
	this->position	= position;
	this->rotation	= D3DXVECTOR3(0, 0, 0);
	this->scale		= D3DXVECTOR2(2.0f, 2.0f);
	this->speed		= D3DXVECTOR3(0, 0, 0);
	this->limitTime	= 1.0f;
	this->uv.x		= 0.125f*7;
	this->uv.y		= 0.125f*7;
}

//===================================================================================================================================
//【インスタンスクラス：更新】
//===================================================================================================================================
void TestPlaneInstance::update(float frameTime)
{
	//lifeTimer += frameTime;
	if (lifeTimer >= limitTime)return;
}

//===================================================================================================================================
//【コンストラクタ】
//===================================================================================================================================
TestPlane::TestPlane() :InstancingBillboard::InstancingBillboard()
{
	InstancingBillboard::initialize(*textureNS::reference(textureNS::SPLASH),7,7);

	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(0, 10, 30)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(0, 20, -220)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-10, 15, -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-5,  15, -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(0,   15,  -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(5,   15,  -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -220)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -215)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -210)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -205)));
	//generateInstance(new TestPlaneInstance(D3DXVECTOR3(-15, 15, -200)));

}

//===================================================================================================================================
//【デストラクタ】
//===================================================================================================================================
TestPlane::~TestPlane()
{
}

//===================================================================================================================================
//【更新】
//===================================================================================================================================
void TestPlane::update(float frameTime)
{
	InstancingBillboard::update(frameTime);
}
