////-----------------------------------------------------------------------------
//// クラス [.h]　実験用
//// Author : 新里
//// 作成開始日 : 2019/10/21  
////-----------------------------------------------------------------------------
//#pragma once
//
////===================================================================================================================================
////【インクルード】
////===================================================================================================================================
//#include "InstancingBillboard.h"
//
////===================================================================================================================================
////【名前空間】
////===================================================================================================================================
//namespace testEffectOccurrenceNS
//{
//	class TestEffectOcurrenceInstance :public InstancingBillboardNS::Instance
//	{
//	public:
//		//コンストラクタ
//		TestEffectOcurrenceInstance();
//		//更新
//		virtual void update(float frameTime) override;
//	};
//}
//
//
//class TestEffectOccurrence :public InstancingBillboard
//{
//private:
//
//public:
//	TestEffectOccurrence();
//	~TestEffectOccurrence();
//	void update(float frameTime);
//};
//
