//===================================================================================================================================
//【TextureLoader.h】
// [作成者]HAL東京GP12A332 11 菅野 樹
// [作成日]2019/09/23
// [更新日]2019/10/24
//===================================================================================================================================
//===================================================================================================================================
//課題
//シーン別に読込リソースを分割し読み込む
//===================================================================================================================================
#pragma once

//===================================================================================================================================
//【インクルード】
//===================================================================================================================================
#include "Base.h"

//===================================================================================================================================
//【名前空間】
//===================================================================================================================================
namespace textureNS
{
	enum TEXTURE_NUMBER
	{
		// Splash
		SPLASH,

		// Tutorial
		TUTORIAL1,
		TUTORIAL2,

		// Title
		TITLE_LOGO,
		TITLE_MENU,
		TITLE_INFO_TUTO,
		TITLE_INFO_GAME,
		TITLE_INFO_CREDIT,
		TITLE_INFO_EXIT,
		TITLE_COPYRIGHT,			
		TITLE_BAR,				

		// Credit
		CREDIT,

		// Game
		UI_COUNT_DOWN_ONE,

		// Result
		RESULT_WINDOW,

		// etc
		TOON_OUT_LINE,
		TOON_SHADE,
		LIGHT_001,
		TARGET,
		SAMPLE_TREE,
		SAMPLE_GRASS,
		NEKO,

		MAX_TEXTURE,
	};

	//テクスチャ外部参照関数
	LPDIRECT3DTEXTURE9* reference(int textureNo);

}

//===================================================================================================================================
//【テクスチャ読込クラス】
//===================================================================================================================================
class TextureLoader : public Base
{
private:
	const char* textureName[textureNS::MAX_TEXTURE];
	LPDIRECT3DTEXTURE9 texture[textureNS::MAX_TEXTURE];
public:
	TextureLoader();
	~TextureLoader();

	void load(LPDIRECT3DDEVICE9 device);
	void release();

	LPDIRECT3DTEXTURE9* getTexture(int textureNo) { return &texture[textureNo]; }
};

