//-----------------------------------------------------------------------------
// ツリー基底クラス [Tree.cpp]
// Author : HAL東京昼間部 2年制ゲーム学科 GP12A332 32 中込和輝
// 作成開始日 : 2019/10/13
//-----------------------------------------------------------------------------
#include "Tree.h"
#include "ImguiManager.h"
using namespace treeNS;


int Tree::numOfTree = 0;

//=============================================================================
// コンストラクタ
//=============================================================================
Tree::Tree(): StaticMeshObject(staticMeshNS::reference(staticMeshNS::SAMPLE_REDBULL))
{
	numOfTree++;
}


//=============================================================================
// デストラクタ
//=============================================================================
Tree::~Tree()
{
	numOfTree--;
}


//=============================================================================
// 更新処理
//=============================================================================
void Tree::update(float frameTime)
{
}


//=============================================================================
// 描画処理
//=============================================================================
void Tree::render(D3DXMATRIX view, D3DXMATRIX projection, D3DXVECTOR3 cameraPosition)
{
	StaticMeshObject::render(
		*shaderNS::reference(shaderNS::INSTANCE_STATIC_MESH), view, projection, cameraPosition);
}


//=============================================================================
// Getter
//=============================================================================
int Tree::getNumOfTree(){ return numOfTree; }
TreeData* Tree::getTreeData() { return treeData; }


//=============================================================================
// Setter
//=============================================================================
void Tree::setDataToTree(TreeData* _treeData) { treeData = _treeData; }
